01 HlEvent.
    05 EventName pic x(40) value spaces.
    05 EventBaseCharge pic 999 value zero.
    05 EventStartDay value "Fri".
    05 EventEndDay value "Sun".
    